sencercoltu/openvr-customhmd/stm32/TrackedDevice/Src/main.c
/**
  ******************************************************************************
  * File Name          : main.c
  * Description        : Main program body
  ******************************************************************************
  *
  * Copyright (c) 2017 STMicroelectronics International N.V. 
  * All rights reserved.
  *
  * Redistribution and use in source and binary forms, with or without 
  * modification, are permitted, provided that the following conditions are met:
  *
  * 1. Redistribution of source code must retain the above copyright notice, 
  *    this list of conditions and the following disclaimer.
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  * 3. Neither the name of STMicroelectronics nor the names of other 
  *    contributors to this software may be used to endorse or promote products 
  *    derived from this software without specific written permission.
  * 4. This software, including modifications and/or derivative works of this 
  *    software, must execute solely and exclusively on microcontroller or
  *    microprocessor devices manufactured by or for STMicroelectronics.
  * 5. Redistribution and use of this software other than as permitted under 
  *    this license is void and will automatically terminate your rights under 
  *    this license. 
  *
  * THIS SOFTWARE IS PROVIDED BY STMICROELECTRONICS AND CONTRIBUTORS "AS IS" 
  * AND ANY EXPRESS, IMPLIED OR STATUTORY WARRANTIES, INCLUDING, BUT NOT 
  * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A 
  * PARTICULAR PURPOSE AND NON-INFRINGEMENT OF THIRD PARTY INTELLECTUAL PROPERTY
  * RIGHTS ARE DISCLAIMED TO THE FULLEST EXTENT PERMITTED BY LAW. IN NO EVENT 
  * SHALL STMICROELECTRONICS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
  * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
  * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, 
  * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF 
  * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING 
  * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
  * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f1xx_hal.h"
#include "usb_device.h"

/* USER CODE BEGIN Includes */
#include <stdlib.h>
#include <string.h> //for memcpy and memcmp

#include "..\\..\\Common\\led.h"
#include "..\\..\\Common\\SensorFusion.h"
#include "..\\..\\Common\\gy8x.h"
#include "..\\..\\Common\\nrf24l01.h"
#include "..\\..\\Common\\usb.h"
#include "usbd_custom_hid_if.h"
#include "..\\..\\Common\\eeprom_flash.h"

#if CUSTOM_HID_EPOUT_SIZE != 32
#error HID out packet size not 32
#end
#elif CUSTOM_HID_EPIN_SIZE != 32
#error HID packet in size not 32
#end
#elif USB_CUSTOM_HID_DESC_SIZ != 34
#error HID packet size not 34
#end
#endif

#define THIS_DEVICE HMD_SOURCE
#define IS_CONTROLLER (THIS_DEVICE == LEFTCTL_SOURCE || RIGHT_DEVICE == LEFTCTL_SOURCE)
#define IS_HMD (THIS_DEVICE == HMD_SOURCE)
/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;
DMA_HandleTypeDef hdma_adc1;

I2C_HandleTypeDef hi2c2;

SPI_HandleTypeDef hspi2;

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/
enum RawModes
{
	RawMode_Off = 0,
	RawMode_Raw = 1,
	RawMode_Filtered = 2,        
	RawMode_Compensated = 3,
	RawMode_DRVectors = 4
};

#if IS_HMD
struct CommChannel
{	
	uint8_t remainingTransmits;
	uint32_t lastReceive;
	uint32_t nextTransmit;
	uint16_t lastInSequence;
	uint16_t lastOutSequence;
	USBPacket lastCommand;	
};

struct CommChannel Channels[MAX_SOURCE] = {0};
uint16_t ChannelStateFlags = 0;
#endif //IS_HMD

SensorData tSensorData;
int32_t blinkDelay = 1000;
extern uint8_t USB_RX_Buffer[CUSTOM_HID_EPIN_SIZE];
extern USBD_HandleTypeDef hUsbDeviceFS;
USBPacket *pFromUSBPacket = (USBPacket *) USB_RX_Buffer;
USBPacket FromDevicePacket = {0};
USBPacket FromRFPacket = {0};
USBPositionData position = {0};

uint8_t rfStatus = 0;
bool sensorStatus = false;
RawModes feedRawMode = RawMode_Off;
uint8_t readyToSend = 0;
uint8_t readyToReceive = 0;
Quaternion orientQuat;
Quaternion gravQuat;
Quaternion positionQuat;
//Quaternion gravQuat(0, 0, 0, 1);
//RF_ReceiveMode(&hspi2, NULL); //default to receive mode			
uint32_t lastCommandSequence = 0;

#if IS_CONTROLLER
uint32_t vibrationStopTime0 = 0;	
uint32_t vibrationStopTime1 = 0;	
uint32_t LastADCChange = 0;	
uint32_t ADC_Values[4] = {0};
float ADC_Value[2] = {0};
uint32_t ADC_Cache[2] = {0};
#endif //_IS_CONTROLLER

uint64_t lastButtonRefresh = 0;		
volatile uint32_t LastDigitalChange = 0;
uint16_t DigitalValues = 0;
uint16_t DigitalCache = 0;
//float AccelVector[3] = {0};
float GravityVector[3] = {0};
float CompAccelVector[3] = {0};
float VelocityVector[3] = {0};
//float ComplimentaryAccelVector[3] = {0};
//float ComplimentaryVelocityVector[3] = {0};

uint64_t lastRotationUpdate = 0; 
uint64_t now = 0;     
uint32_t ticks = 0;
uint32_t nextSend = 0; 

uint32_t sndCounter = 0;
uint32_t rcvCounter = 0;

EepromData eepromData = {0};
bool isCalibrated = false;
bool isPositionReady = false;

int extraDelay = 2
#if IS_CONTROLLER
	+8
#endif //IS_CONTROLLER
	;


#define READY_ROT 0x01
#define READY_BUT 0x02
#define READY_POS 0x04
#define READY_RAW 0x08
#define READY_CAL 0x10

uint8_t ReadyMask = 0;
uint8_t ProcessMask = 0;

uint32_t LastUsbTransmit = 0;

bool hasRotationData = false;
bool hasPositionData = false;
uint8_t buttonRetransmit = 0;

//KalmanSingle AccelFilter[3] = {
//KalmanSingle(0.125,32,1,0),
//KalmanSingle(0.125,32,1,0),
//KalmanSingle(0.125,32,1,0)
//};

