sencercoltu/openvr-customhmd/stm32/TrackedDevice/Src/main.c
	//do some warmup
	for (int i=0; i<100; i++)
	{
		readAccelData(tSensorData.Accel.Raw);  // Read the x/y/z adc values		
		tSensorData.Accel.ProcessNew();
		HAL_Delay(1);
		readGyroData(tSensorData.Gyro.Raw); 
		tSensorData.Gyro.ProcessNew();
		HAL_Delay(1);
		readMagData(tSensorData.Mag.Raw);
		tSensorData.Mag.ProcessNew();
		HAL_Delay(10);
	}
	
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
	
	while (true)
	{	
		Blink(blinkDelay);
		blinkDelay = 1000;
		
		now = HAL_GetMicros();
		ticks = HAL_GetTick(); //now / 1000;
		
		if (eepromSaveTime && (ticks >= eepromSaveTime))
		{
			CalibrateSensors();
			eepromData.Magic = VALID_EEPROM_MAGIC;
			enableEEPROMWriting();
			char *eepromBytes = (char *)&eepromData;	
			int addr = 0;
			for (int i=0; i<sizeof(eepromData); i+=sizeof(uint32_t))
			{
				writeEEPROMWord(addr, *((uint32_t *)(&eepromBytes[i])));
				addr += sizeof(uint32_t);
			}
			disableEEPROMWriting();
			eepromSaveTime = 0;
		}
		
#if IS_CONTROLLER
		if (vibrationStopTime0 && (ticks > vibrationStopTime0))
		{
			HAL_GPIO_WritePin(CTL_VIBRATE0_GPIO_Port, CTL_VIBRATE0_Pin, GPIO_PIN_RESET);
			vibrationStopTime0 = 0;
		}
		
		if (vibrationStopTime1 && (ticks > vibrationStopTime1))
		{
			HAL_GPIO_WritePin(CTL_VIBRATE1_GPIO_Port, CTL_VIBRATE1_Pin, GPIO_PIN_RESET);
			vibrationStopTime1 = 0;
		}
		ProcessADC();
#endif //IS_CONTROLLER
			
		if (LastDigitalChange && (ticks - LastDigitalChange >= 25)) //using sw debounce 
		{			
			LastDigitalChange = 0;
			DigitalValues = 0;
			if (HAL_GPIO_ReadPin(CTL_BTN0_GPIO_Port, CTL_BTN0_Pin) == GPIO_PIN_SET) DigitalValues |= BUTTON_0;
			if (HAL_GPIO_ReadPin(CTL_BTN1_GPIO_Port, CTL_BTN1_Pin) == GPIO_PIN_SET) DigitalValues |= BUTTON_1;
			if (HAL_GPIO_ReadPin(CTL_BTN2_GPIO_Port, CTL_BTN2_Pin) == GPIO_PIN_SET) DigitalValues |= BUTTON_2;
			if (HAL_GPIO_ReadPin(CTL_BTN3_GPIO_Port, CTL_BTN3_Pin) == GPIO_PIN_SET) DigitalValues |= BUTTON_3;				
			if (HAL_GPIO_ReadPin(CTL_BTN4_GPIO_Port, CTL_BTN4_Pin) == GPIO_PIN_SET) DigitalValues |= BUTTON_4;
			if (HAL_GPIO_ReadPin(CTL_BTN5_GPIO_Port, CTL_BTN5_Pin) == GPIO_PIN_SET) DigitalValues |= BUTTON_5;
			if (HAL_GPIO_ReadPin(CTL_BTN6_GPIO_Port, CTL_BTN6_Pin) == GPIO_PIN_SET) DigitalValues |= BUTTON_6;
			if (HAL_GPIO_ReadPin(CTL_BTN7_GPIO_Port, CTL_BTN7_Pin) == GPIO_PIN_SET) DigitalValues |= BUTTON_7;
			
			if (DigitalCache != DigitalValues)
			{
				//if any digital value has changes
				DigitalCache = DigitalValues;
				//hasTriggerData = true;
				buttonRetransmit = 1
#if IS_CONTROLLER						
				+4
#endif //IS_CONTROLLER
				;
				lastButtonRefresh = ticks;				
			}
		}
#if IS_CONTROLLER		
		if (ticks - lastButtonRefresh >= buttonRefreshTimeout)
		{
			//update button status every 250ms.
			buttonRetransmit++;
			lastButtonRefresh = ticks;			
		}
#endif //IS_CONTROLLER
		ProcessSensors();

#if IS_HMD
		//process only COMMAND packets from USB		
		if (((pFromUSBPacket->Header.Type & 0xF0) == COMMAND_DATA) && (pFromUSBPacket->Command.Command != CMD_NONE))
		{		
			if (CheckPacketCrc(pFromUSBPacket)) 
			{
				uint8_t channelIndex = pFromUSBPacket->Header.Type & 0x0F; 
				if (channelIndex == THIS_DEVICE)			
				{	
					ProcessOwnPacket(pFromUSBPacket);
				}
				else if (channelIndex < MAX_SOURCE)
				{
					//forward from USB to RF
					CommChannel *pChannel = &Channels[channelIndex];			
					//only send if active more than 1 sec
					if (pChannel->lastOutSequence != pFromUSBPacket->Header.Sequence && now - pChannel->lastReceive <= 1000)
					{			
						//got packet from usb, forward to trackeddevice
						memcpy(&pChannel->lastCommand, pFromUSBPacket, sizeof(USBPacket));			
						//send same packet a few times
						pChannel->remainingTransmits = 5;			
						pChannel->nextTransmit = now;
						pChannel->lastOutSequence = pFromUSBPacket->Header.Sequence;
						ChannelStateFlags |= 1 << channelIndex;
					}
					memset(pFromUSBPacket, 0, sizeof(USBPacket)); //clear incoming
				}
			}
		}
#endif //IS_HMD
		
		rfStatus = RF_Status(&hspi2);
		readyToReceive = (rfStatus & RF_RX_DR_IRQ_CLEAR) == RF_RX_DR_IRQ_CLEAR ? 1 : 0;

		if (readyToReceive)
		{
			rfStatus = RF_FifoStatus(&hspi2);
			readyToReceive = (rfStatus & RF_RX_FIFO_EMPTY_Bit) == 0x00 ? 1: 0;
			rcvCounter = 0;
			while ((rcvCounter < 3) && readyToReceive) //max 3 packets 
			//if (readyToReceive) //one rf packet at a time
			{			
				rcvCounter++;
				//receive command
				//has fifo, receive
				readyToReceive = RF_ReceivePayload(&hspi2, (uint8_t*)&FromRFPacket, sizeof(USBPacket)) == 0 ? 1: 0; //if not empty 
				if (CheckPacketCrc(&FromRFPacket))
				{
					if (((FromRFPacket.Header.Type & 0x0F)) == THIS_DEVICE)
					{					
						ProcessOwnPacket(&FromRFPacket);									
					}						
#if IS_HMD
					else
					{
						//forward from RF to USB
						while (HAL_GetTick() - LastUsbTransmit <= extraDelay) {};
						ForwardPacket(&FromRFPacket);
					}
#endif //IS_HMD	
				}
			}
		}	

#if IS_HMD		
		BroadcastRFPackets();
#endif //IS_HMD	
		
		
		if (!ProcessMask)
		{
			if (buttonRetransmit)
				ReadyMask |= READY_BUT;
			if (feedRawMode)
				ReadyMask |= READY_RAW;
			if (SensorCalibRequest != 0xFF)
				ReadyMask |= READY_CAL;
			if (ReadyMask)
			{
				ProcessMask = ReadyMask;
				ReadyMask = 0;
			}
		}
		ticks = HAL_GetTick(); 
		if (ProcessMask && (ticks >= nextSend))
		{			
#if IS_CONTROLLER
			rfStatus = RF_FifoStatus(&hspi2); 
			readyToSend = (rfStatus & RF_TX_FIFO_FULL_Bit) == 0x00 ? 1 : 0;			
#endif //IS_CONTROLLER			
#if IS_HMD
			while (HAL_GetTick() - LastUsbTransmit <= extraDelay) {};
			readyToSend = 1;
#endif //IS_HMD
		}	
		
		if (readyToSend)
		{
#if IS_CONTROLLER			
			RF_TransmitMode(&hspi2, RF_InitStruct.RF_TX_Adress); //switch to tx mode
#endif //IS_CONTROLLER			
			//HAL_MicroDelay(10);			
			blinkDelay = 100;

			sndCounter++;
			
			if (ProcessMask & READY_CAL)
			{
				FromDevicePacket.Header.Type = THIS_DEVICE | COMMAND_DATA;
				FromDevicePacket.Header.Sequence++;				
				FromDevicePacket.Command.Command = CMD_CALIBRATE;
				if (SensorCalibRequest == SENSOR_ACCEL)
					FromDevicePacket.Command.Data.Calibration = eepromData.Accel;
				else if (SensorCalibRequest == SENSOR_GYRO)
					FromDevicePacket.Command.Data.Calibration = eepromData.Gyro;
				else if (SensorCalibRequest == SENSOR_MAG)
					FromDevicePacket.Command.Data.Calibration = eepromData.Mag;
				FromDevicePacket.Command.Data.Calibration.Command = CALIB_GET;
				FromDevicePacket.Command.Data.Calibration.Sensor = SensorCalibRequest;
				SensorCalibRequest = 0xFF;
				SetPacketCrc(&FromDevicePacket);
				ForwardPacket(&FromDevicePacket);
				ProcessMask &= ~READY_CAL;
			}
			else if (ProcessMask & READY_RAW)
			{	
				FromDevicePacket.Header.Type = THIS_DEVICE | COMMAND_DATA;
				FromDevicePacket.Header.Sequence++;				
				FromDevicePacket.Command.Command = CMD_RAW_DATA;
				FromDevicePacket.Command.Data.Raw.State = feedRawMode;
				for (int idx=0; idx<3; idx++)
				{
					switch(feedRawMode)
					{
						case RawMode_Off:
							break;
						case RawMode_Raw:
						{
							//raw sensor values
							FromDevicePacket.Command.Data.Raw.Accel[idx] = tSensorData.Accel.Raw[idx];
							FromDevicePacket.Command.Data.Raw.Gyro[idx] = tSensorData.Gyro.Raw[idx];
							FromDevicePacket.Command.Data.Raw.Mag[idx] = tSensorData.Mag.Raw[idx];
							break;
						}
						case RawMode_Filtered:
						{
							//filtered sensor data
							FromDevicePacket.Command.Data.Raw.Accel[idx] = tSensorData.Accel.Filtered[idx];
							FromDevicePacket.Command.Data.Raw.Gyro[idx] = tSensorData.Gyro.Filtered[idx];
							FromDevicePacket.Command.Data.Raw.Mag[idx] = tSensorData.Mag.Filtered[idx];
							break;
						}
						case RawMode_Compensated:
						{
							//compensated sensor data
							FromDevicePacket.Command.Data.Raw.Accel[idx] = tSensorData.Accel.Compensated[idx];
							FromDevicePacket.Command.Data.Raw.Gyro[idx] = tSensorData.Gyro.Compensated[idx];
							FromDevicePacket.Command.Data.Raw.Mag[idx] = tSensorData.Mag.Compensated[idx];
							break;
						}
						case RawMode_DRVectors:
						{
							//deadreckoning vectors
							FromDevicePacket.Command.Data.Raw.Accel[idx] = (int16_t)(GravityVector[idx] / aRes);
							FromDevicePacket.Command.Data.Raw.Gyro[idx] = (int16_t)(CompAccelVector[idx] / aRes); //in m/s2
							FromDevicePacket.Command.Data.Raw.Mag[idx] = VelocityVector[idx] * 1000; //in mm/s
							break;
						}
					}
				}
				SetPacketCrc(&FromDevicePacket);
				ForwardPacket(&FromDevicePacket);
				ProcessMask &= ~READY_RAW;
			}			
			else if (ProcessMask & READY_POS)
			{					
				hasPositionData = false;				
				FromDevicePacket.Header.Type = THIS_DEVICE | POSITION_DATA;
				FromDevicePacket.Header.Sequence++;
				
				//remap
				FromDevicePacket.Position.Position[0] = positionQuat.x; //position.Position[0];
				FromDevicePacket.Position.Position[1] = positionQuat.z; //position.Position[2];
				FromDevicePacket.Position.Position[2] = -positionQuat.y; //-position.Position[1];
				SetPacketCrc(&FromDevicePacket);
				ForwardPacket(&FromDevicePacket);
				ProcessMask &= ~READY_POS;
			}
			else if (ProcessMask & READY_ROT)
			{			
				//send rot data
				hasRotationData = false;				
				FromDevicePacket.Header.Type = THIS_DEVICE | ROTATION_DATA;
				FromDevicePacket.Header.Sequence++;
				//remap				
				FromDevicePacket.Rotation.w = orientQuat.w;
				FromDevicePacket.Rotation.x = orientQuat.x;
				FromDevicePacket.Rotation.y = orientQuat.z;
				FromDevicePacket.Rotation.z = -orientQuat.y;					
				SetPacketCrc(&FromDevicePacket);
				ForwardPacket(&FromDevicePacket);
				ProcessMask &= ~READY_ROT;
			}		
			else if (ProcessMask & READY_BUT)
			{			
				buttonRetransmit--;				
				FromDevicePacket.Header.Type = THIS_DEVICE | TRIGGER_DATA;
				FromDevicePacket.Header.Sequence++;
#if IS_HMD					
				FromDevicePacket.Trigger.Analog[0].x = 0;
				FromDevicePacket.Trigger.Analog[0].y = 0;
				FromDevicePacket.Trigger.Analog[1].x = 0; //reserved
				FromDevicePacket.Trigger.Analog[1].y = 0; //reserved
#endif //IS_HMD					

#if IS_CONTROLLER					
				FromDevicePacket.Trigger.Analog[0].x = ((float)ADC_Cache[0]) / 100.0f; //trigger
				FromDevicePacket.Trigger.Analog[0].y = ((float)ADC_Cache[1]) / 100.0f; //IPD
				FromDevicePacket.Trigger.Analog[1].x = 0; //reserved
				FromDevicePacket.Trigger.Analog[1].y = 0; //reserved
#endif //IS_CONTROLLER
				
				FromDevicePacket.Trigger.Digital = DigitalCache;
				SetPacketCrc(&FromDevicePacket);
				ForwardPacket(&FromDevicePacket);
				ProcessMask &= ~READY_BUT;
//#if IS_CONTROLLER				
				//rfStatus = RF_FifoStatus(&hspi2); readyToSend = (rfStatus & RF_TX_FIFO_FULL_Bit) == 0x00 ? 1 : 0;									
//#endif //IS_CONTROLLER				
			}

			if (!ProcessMask)
#if IS_CONTROLLER			
				nextSend = ticks + (extraDelay + (rand() % 10)); //for next RF packet
			do { rfStatus = RF_FifoStatus(&hspi2); } while ((rfStatus & RF_TX_FIFO_EMPTY_Bit) != RF_TX_FIFO_EMPTY_Bit); //wait for send complete			
#endif //IS_CONTROLLER			
#if IS_HMD
				nextSend = ticks + extraDelay; //for next USB packet
#endif //IS_HMD
			
			readyToSend = 0;
#if IS_CONTROLLER
			HAL_MicroDelay(10);
			RF_ReceiveMode(&hspi2, RF_InitStruct.RF_RX_Adress_Pipe0); //back to rx mode
#endif //IS_CONTROLLER			
		}
	}
  /* USER CODE END WHILE */

